codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mz0512efk144.h
extern volatile __CNNEJbits_t CNNEJbits __asm__ ("CNNEJ") __attribute__((section("sfrs")));
extern volatile unsigned int        CNFJ __attribute__((section("sfrs")));
typedef struct {
  unsigned CNFJ0:1;
  unsigned CNFJ1:1;
  unsigned CNFJ2:1;
  unsigned CNFJ3:1;
  unsigned CNFJ4:1;
  unsigned CNFJ5:1;
  unsigned CNFJ6:1;
  unsigned CNFJ7:1;
  unsigned CNFJ8:1;
  unsigned CNFJ9:1;
  unsigned CNFJ10:1;
  unsigned CNFJ11:1;
  unsigned CNFJ12:1;
  unsigned CNFJ13:1;
  unsigned CNFJ14:1;
  unsigned CNFJ15:1;
} __CNFJbits_t;
extern volatile __CNFJbits_t CNFJbits __asm__ ("CNFJ") __attribute__((section("sfrs")));
extern volatile unsigned int        TRISK __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned TRISK0:1;
    unsigned TRISK1:1;
    unsigned TRISK2:1;
    unsigned TRISK3:1;
    unsigned TRISK4:1;
    unsigned TRISK5:1;
    unsigned TRISK6:1;
    unsigned TRISK7:1;
  };
  struct {
    unsigned w:32;
  };
} __TRISKbits_t;
extern volatile __TRISKbits_t TRISKbits __asm__ ("TRISK") __attribute__((section("sfrs")));
extern volatile unsigned int        TRISKCLR __attribute__((section("sfrs")));
extern volatile unsigned int        TRISKSET __attribute__((section("sfrs")));
extern volatile unsigned int        TRISKINV __attribute__((section("sfrs")));
extern volatile unsigned int        PORTK __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned RK0:1;
    unsigned RK1:1;
    unsigned RK2:1;
    unsigned RK3:1;
    unsigned RK4:1;
    unsigned RK5:1;
    unsigned RK6:1;
    unsigned RK7:1;
  };
  struct {
    unsigned w:32;
  };
} __PORTKbits_t;
extern volatile __PORTKbits_t PORTKbits __asm__ ("PORTK") __attribute__((section("sfrs")));
extern volatile unsigned int        PORTKCLR __attribute__((section("sfrs")));
extern volatile unsigned int        PORTKSET __attribute__((section("sfrs")));
extern volatile unsigned int        PORTKINV __attribute__((section("sfrs")));
extern volatile unsigned int        LATK __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned LATK0:1;
    unsigned LATK1:1;
    unsigned LATK2:1;
    unsigned LATK3:1;
    unsigned LATK4:1;
    unsigned LATK5:1;
    unsigned LATK6:1;
    unsigned LATK7:1;
  };
  struct {
    unsigned w:32;
  };
} __LATKbits_t;
extern volatile __LATKbits_t LATKbits __asm__ ("LATK") __attribute__((section("sfrs")));
extern volatile unsigned int        LATKCLR __attribute__((section("sfrs")));
extern volatile unsigned int        LATKSET __attribute__((section("sfrs")));
extern volatile unsigned int        LATKINV __attribute__((section("sfrs")));
extern volatile unsigned int        ODCK __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned ODCK0:1;
    unsigned ODCK1:1;
    unsigned ODCK2:1;
    unsigned ODCK3:1;
    unsigned ODCK4:1;
    unsigned ODCK5:1;
    unsigned ODCK6:1;
    unsigned ODCK7:1;
  };
  struct {
    unsigned w:32;
  };
} __ODCKbits_t;
extern volatile __ODCKbits_t ODCKbits __asm__ ("ODCK") __attribute__((section("sfrs")));
extern volatile unsigned int        ODCKCLR __attribute__((section("sfrs")));
extern volatile unsigned int        ODCKSET __attribute__((section("sfrs")));
extern volatile unsigned int        ODCKINV __attribute__((section("sfrs")));
extern volatile unsigned int        CNPUK __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CNPUK0:1;
    unsigned CNPUK1:1;
    unsigned CNPUK2:1;
    unsigned CNPUK3:1;
    unsigned CNPUK4:1;
    unsigned CNPUK5:1;
    unsigned CNPUK6:1;
    unsigned CNPUK7:1;
  };
  struct {
    unsigned w:32;
  };
} __CNPUKbits_t;
extern volatile __CNPUKbits_t CNPUKbits __asm__ ("CNPUK") __attribute__((section("sfrs")));
extern volatile unsigned int        CNPUKCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CNPUKSET __attribute__((section("sfrs")));
extern volatile unsigned int        CNPUKINV __attribute__((section("sfrs")));
extern volatile unsigned int        CNPDK __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CNPDK0:1;
    unsigned CNPDK1:1;
    unsigned CNPDK2:1;
    unsigned CNPDK3:1;
    unsigned CNPDK4:1;
    unsigned CNPDK5:1;
    unsigned CNPDK6:1;
    unsigned CNPDK7:1;
  };
  struct {
    unsigned w:32;
  };
} __CNPDKbits_t;
extern volatile __CNPDKbits_t CNPDKbits __asm__ ("CNPDK") __attribute__((section("sfrs")));
extern volatile unsigned int        CNPDKCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CNPDKSET __attribute__((section("sfrs")));
extern volatile unsigned int        CNPDKINV __attribute__((section("sfrs")));
extern volatile unsigned int        CNCONK __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned :11;
    unsigned EDGEDETECT:1;
    unsigned :1;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned w:32;
  };
} __CNCONKbits_t;
extern volatile __CNCONKbits_t CNCONKbits __asm__ ("CNCONK") __attribute__((section("sfrs")));
extern volatile unsigned int        CNCONKCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CNCONKSET __attribute__((section("sfrs")));
extern volatile unsigned int        CNCONKINV __attribute__((section("sfrs")));
extern volatile unsigned int        CNENK __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CNIEK0:1;
    unsigned CNIEK1:1;
    unsigned CNIEK2:1;
    unsigned CNIEK3:1;
    unsigned CNIEK4:1;
    unsigned CNIEK5:1;
    unsigned CNIEK6:1;
    unsigned CNIEK7:1;
  };
  struct {
    unsigned w:32;
  };
} __CNENKbits_t;
extern volatile __CNENKbits_t CNENKbits __asm__ ("CNENK") __attribute__((section("sfrs")));
extern volatile unsigned int        CNENKCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CNENKSET __attribute__((section("sfrs")));
extern volatile unsigned int        CNENKINV __attribute__((section("sfrs")));
extern volatile unsigned int        CNSTATK __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CNSTATK0:1;
    unsigned CNSTATK1:1;
    unsigned CNSTATK2:1;
    unsigned CNSTATK3:1;
    unsigned CNSTATK4:1;
    unsigned CNSTATK5:1;
    unsigned CNSTATK6:1;
    unsigned CNSTATK7:1;
  };
  struct {
    unsigned w:32;
  };
} __CNSTATKbits_t;
extern volatile __CNSTATKbits_t CNSTATKbits __asm__ ("CNSTATK") __attribute__((section("sfrs")));
extern volatile unsigned int        CNSTATKCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CNSTATKSET __attribute__((section("sfrs")));
extern volatile unsigned int        CNSTATKINV __attribute__((section("sfrs")));
extern volatile unsigned int        CNNEK __attribute__((section("sfrs")));
typedef struct {
  unsigned CNNEK0:1;
  unsigned CNNEK1:1;
  unsigned CNNEK2:1;
  unsigned CNNEK3:1;
  unsigned CNNEK4:1;
  unsigned CNNEK5:1;
  unsigned CNNEK6:1;
  unsigned CNNEK7:1;
} __CNNEKbits_t;
extern volatile __CNNEKbits_t CNNEKbits __asm__ ("CNNEK") __attribute__((section("sfrs")));
extern volatile unsigned int        CNFK __attribute__((section("sfrs")));
typedef struct {
  unsigned CNFK0:1;
  unsigned CNFK1:1;
  unsigned CNFK2:1;
  unsigned CNFK3:1;
  unsigned CNFK4:1;
  unsigned CNFK5:1;
  unsigned CNFK6:1;
  unsigned CNFK7:1;
} __CNFKbits_t;
extern volatile __CNFKbits_t CNFKbits __asm__ ("CNFK") __attribute__((section("sfrs")));
extern volatile unsigned int        C1CON __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned DNCNT:5;
    unsigned :6;
    unsigned CANBUSY:1;
    unsigned :1;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
    unsigned :4;
    unsigned CANCAP:1;
    unsigned OPMOD:3;
    unsigned REQOP:3;
    unsigned ABAT:1;
  };
  struct {
    unsigned w:32;
  };
} __C1CONbits_t;
extern volatile __C1CONbits_t C1CONbits __asm__ ("C1CON") __attribute__((section("sfrs")));
extern volatile unsigned int        C1CONCLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1CONSET __attribute__((section("sfrs")));
extern volatile unsigned int        C1CONINV __attribute__((section("sfrs")));
extern volatile unsigned int        C1CFG __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned BRP:6;
    unsigned SJW:2;
    unsigned PRSEG:3;
    unsigned SEG1PH:3;
    unsigned SAM:1;
    unsigned SEG2PHTS:1;
    unsigned SEG2PH:3;
    unsigned :3;
    unsigned WAKFIL:1;
  };
  struct {
    unsigned w:32;
  };
} __C1CFGbits_t;
extern volatile __C1CFGbits_t C1CFGbits __asm__ ("C1CFG") __attribute__((section("sfrs")));
extern volatile unsigned int        C1CFGCLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1CFGSET __attribute__((section("sfrs")));
extern volatile unsigned int        C1CFGINV __attribute__((section("sfrs")));
extern volatile unsigned int        C1INT __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned TBIF:1;
    unsigned RBIF:1;
    unsigned CTMRIF:1;
    unsigned MODIF:1;
    unsigned :7;
    unsigned RBOVIF:1;
    unsigned SERRIF:1;
    unsigned CERRIF:1;
    unsigned WAKIF:1;
    unsigned IVRIF:1;
    unsigned TBIE:1;
    unsigned RBIE:1;
    unsigned CTMRIE:1;
    unsigned MODIE:1;
    unsigned :7;
    unsigned RBOVIE:1;
    unsigned SERRIE:1;
    unsigned CERRIE:1;
    unsigned WAKIE:1;
    unsigned IVRIE:1;
  };
  struct {
    unsigned w:32;
  };
} __C1INTbits_t;
extern volatile __C1INTbits_t C1INTbits __asm__ ("C1INT") __attribute__((section("sfrs")));
extern volatile unsigned int        C1INTCLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1INTSET __attribute__((section("sfrs")));
extern volatile unsigned int        C1INTINV __attribute__((section("sfrs")));
extern volatile unsigned int        C1VEC __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned ICODE:7;
    unsigned :1;
    unsigned FILHIT:5;
  };
  struct {
    unsigned w:32;
  };
} __C1VECbits_t;
extern volatile __C1VECbits_t C1VECbits __asm__ ("C1VEC") __attribute__((section("sfrs")));
extern volatile unsigned int        C1VECCLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1VECSET __attribute__((section("sfrs")));
extern volatile unsigned int        C1VECINV __attribute__((section("sfrs")));
extern volatile unsigned int        C1TREC __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned RERRCNT:8;
    unsigned TERRCNT:8;
    unsigned EWARN:1;
    unsigned RXWARN:1;
    unsigned TXWARN:1;
    unsigned RXBP:1;
    unsigned TXBP:1;
    unsigned TXBO:1;
  };
  struct {
    unsigned w:32;
  };
} __C1TRECbits_t;
extern volatile __C1TRECbits_t C1TRECbits __asm__ ("C1TREC") __attribute__((section("sfrs")));
extern volatile unsigned int        C1TRECCLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1TRECSET __attribute__((section("sfrs")));
extern volatile unsigned int        C1TRECINV __attribute__((section("sfrs")));
extern volatile unsigned int        C1FSTAT __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned FIFOIP:32;
  };
  struct {
    unsigned FIFOIP0:1;
    unsigned FIFOIP1:1;
    unsigned FIFOIP2:1;
    unsigned FIFOIP3:1;
    unsigned FIFOIP4:1;
    unsigned FIFOIP5:1;
    unsigned FIFOIP6:1;
    unsigned FIFOIP7:1;
    unsigned FIFOIP8:1;
    unsigned FIFOIP9:1;
    unsigned FIFOIP10:1;
    unsigned FIFOIP11:1;
    unsigned FIFOIP12:1;
    unsigned FIFOIP13:1;
    unsigned FIFOIP14:1;
    unsigned FIFOIP15:1;
    unsigned FIFOIP16:1;
    unsigned FIFOIP17:1;
    unsigned FIFOIP18:1;
    unsigned FIFOIP19:1;
    unsigned FIFOIP20:1;
    unsigned FIFOIP21:1;
    unsigned FIFOIP22:1;
    unsigned FIFOIP23:1;
    unsigned FIFOIP24:1;
    unsigned FIFOIP25:1;
    unsigned FIFOIP26:1;
    unsigned FIFOIP27:1;
    unsigned FIFOIP28:1;
    unsigned FIFOIP29:1;
    unsigned FIFOIP30:1;
    unsigned FIFOIP31:1;
  };
  struct {
    unsigned w:32;
  };
} __C1FSTATbits_t;
extern volatile __C1FSTATbits_t C1FSTATbits __asm__ ("C1FSTAT") __attribute__((section("sfrs")));
extern volatile unsigned int        C1FSTATCLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1FSTATSET __attribute__((section("sfrs")));
extern volatile unsigned int        C1FSTATINV __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXOVF __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned RXOVF:32;
  };
  struct {
    unsigned RXOVF0:1;
    unsigned RXOVF1:1;
    unsigned RXOVF2:1;
    unsigned RXOVF3:1;
    unsigned RXOVF4:1;
    unsigned RXOVF5:1;
    unsigned RXOVF6:1;
    unsigned RXOVF7:1;
    unsigned RXOVF8:1;
    unsigned RXOVF9:1;
    unsigned RXOVF10:1;
    unsigned RXOVF11:1;
    unsigned RXOVF12:1;
    unsigned RXOVF13:1;
    unsigned RXOVF14:1;
    unsigned RXOVF15:1;
    unsigned RXOVF16:1;
    unsigned RXOVF17:1;
    unsigned RXOVF18:1;
    unsigned RXOVF19:1;
    unsigned RXOVF20:1;
    unsigned RXOVF21:1;
    unsigned RXOVF22:1;
    unsigned RXOVF23:1;
    unsigned RXOVF24:1;
    unsigned RXOVF25:1;
    unsigned RXOVF26:1;
    unsigned RXOVF27:1;
    unsigned RXOVF28:1;
    unsigned RXOVF29:1;
    unsigned RXOVF30:1;
    unsigned RXOVF31:1;
  };
  struct {
    unsigned w:32;
  };
} __C1RXOVFbits_t;
extern volatile __C1RXOVFbits_t C1RXOVFbits __asm__ ("C1RXOVF") __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXOVFCLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXOVFSET __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXOVFINV __attribute__((section("sfrs")));
extern volatile unsigned int        C1TMR __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CANTSPRE:16;
    unsigned CANTS:16;
  };
  struct {
    unsigned w:32;
  };
} __C1TMRbits_t;
