codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mz0512efk144.h
#define _ADCCMPEN6_CMPE13_POSITION               0x0000000D
#define _ADCCMPEN6_CMPE13_MASK                   0x00002000
#define _ADCCMPEN6_CMPE13_LENGTH                 0x00000001

#define _ADCCMPEN6_CMPE14_POSITION               0x0000000E
#define _ADCCMPEN6_CMPE14_MASK                   0x00004000
#define _ADCCMPEN6_CMPE14_LENGTH                 0x00000001

#define _ADCCMPEN6_CMPE15_POSITION               0x0000000F
#define _ADCCMPEN6_CMPE15_MASK                   0x00008000
#define _ADCCMPEN6_CMPE15_LENGTH                 0x00000001

#define _ADCCMPEN6_CMPE16_POSITION               0x00000010
#define _ADCCMPEN6_CMPE16_MASK                   0x00010000
#define _ADCCMPEN6_CMPE16_LENGTH                 0x00000001

#define _ADCCMPEN6_CMPE17_POSITION               0x00000011
#define _ADCCMPEN6_CMPE17_MASK                   0x00020000
#define _ADCCMPEN6_CMPE17_LENGTH                 0x00000001

#define _ADCCMPEN6_CMPE18_POSITION               0x00000012
#define _ADCCMPEN6_CMPE18_MASK                   0x00040000
#define _ADCCMPEN6_CMPE18_LENGTH                 0x00000001

#define _ADCCMPEN6_CMPE19_POSITION               0x00000013
#define _ADCCMPEN6_CMPE19_MASK                   0x00080000
#define _ADCCMPEN6_CMPE19_LENGTH                 0x00000001

#define _ADCCMPEN6_CMPE20_POSITION               0x00000014
#define _ADCCMPEN6_CMPE20_MASK                   0x00100000
#define _ADCCMPEN6_CMPE20_LENGTH                 0x00000001

#define _ADCCMPEN6_CMPE21_POSITION               0x00000015
#define _ADCCMPEN6_CMPE21_MASK                   0x00200000
#define _ADCCMPEN6_CMPE21_LENGTH                 0x00000001

#define _ADCCMPEN6_CMPE22_POSITION               0x00000016
#define _ADCCMPEN6_CMPE22_MASK                   0x00400000
#define _ADCCMPEN6_CMPE22_LENGTH                 0x00000001

#define _ADCCMPEN6_CMPE23_POSITION               0x00000017
#define _ADCCMPEN6_CMPE23_MASK                   0x00800000
#define _ADCCMPEN6_CMPE23_LENGTH                 0x00000001

#define _ADCCMPEN6_CMPE24_POSITION               0x00000018
#define _ADCCMPEN6_CMPE24_MASK                   0x01000000
#define _ADCCMPEN6_CMPE24_LENGTH                 0x00000001

#define _ADCCMPEN6_CMPE25_POSITION               0x00000019
#define _ADCCMPEN6_CMPE25_MASK                   0x02000000
#define _ADCCMPEN6_CMPE25_LENGTH                 0x00000001

#define _ADCCMPEN6_CMPE26_POSITION               0x0000001A
#define _ADCCMPEN6_CMPE26_MASK                   0x04000000
#define _ADCCMPEN6_CMPE26_LENGTH                 0x00000001

#define _ADCCMPEN6_CMPE27_POSITION               0x0000001B
#define _ADCCMPEN6_CMPE27_MASK                   0x08000000
#define _ADCCMPEN6_CMPE27_LENGTH                 0x00000001

#define _ADCCMPEN6_CMPE28_POSITION               0x0000001C
#define _ADCCMPEN6_CMPE28_MASK                   0x10000000
#define _ADCCMPEN6_CMPE28_LENGTH                 0x00000001

#define _ADCCMPEN6_CMPE29_POSITION               0x0000001D
#define _ADCCMPEN6_CMPE29_MASK                   0x20000000
#define _ADCCMPEN6_CMPE29_LENGTH                 0x00000001

#define _ADCCMPEN6_CMPE30_POSITION               0x0000001E
#define _ADCCMPEN6_CMPE30_MASK                   0x40000000
#define _ADCCMPEN6_CMPE30_LENGTH                 0x00000001

#define _ADCCMPEN6_CMPE31_POSITION               0x0000001F
#define _ADCCMPEN6_CMPE31_MASK                   0x80000000
#define _ADCCMPEN6_CMPE31_LENGTH                 0x00000001

#define _ADCCMP6_DCMPLO_POSITION                 0x00000000
#define _ADCCMP6_DCMPLO_MASK                     0x0000FFFF
#define _ADCCMP6_DCMPLO_LENGTH                   0x00000010

#define _ADCCMP6_DCMPHI_POSITION                 0x00000010
#define _ADCCMP6_DCMPHI_MASK                     0xFFFF0000
#define _ADCCMP6_DCMPHI_LENGTH                   0x00000010

#define _ADCFLTR1_FLTRDATA_POSITION              0x00000000
#define _ADCFLTR1_FLTRDATA_MASK                  0x0000FFFF
#define _ADCFLTR1_FLTRDATA_LENGTH                0x00000010

#define _ADCFLTR1_CHNLID_POSITION                0x00000010
#define _ADCFLTR1_CHNLID_MASK                    0x001F0000
#define _ADCFLTR1_CHNLID_LENGTH                  0x00000005

#define _ADCFLTR1_AFRDY_POSITION                 0x00000018
#define _ADCFLTR1_AFRDY_MASK                     0x01000000
#define _ADCFLTR1_AFRDY_LENGTH                   0x00000001

#define _ADCFLTR1_AFGIEN_POSITION                0x00000019
#define _ADCFLTR1_AFGIEN_MASK                    0x02000000
#define _ADCFLTR1_AFGIEN_LENGTH                  0x00000001

#define _ADCFLTR1_OVRSAM_POSITION                0x0000001A
#define _ADCFLTR1_OVRSAM_MASK                    0x1C000000
#define _ADCFLTR1_OVRSAM_LENGTH                  0x00000003

#define _ADCFLTR1_DFMODE_POSITION                0x0000001D
#define _ADCFLTR1_DFMODE_MASK                    0x20000000
#define _ADCFLTR1_DFMODE_LENGTH                  0x00000001

#define _ADCFLTR1_DATA16EN_POSITION              0x0000001E
#define _ADCFLTR1_DATA16EN_MASK                  0x40000000
#define _ADCFLTR1_DATA16EN_LENGTH                0x00000001

#define _ADCFLTR1_AFEN_POSITION                  0x0000001F
#define _ADCFLTR1_AFEN_MASK                      0x80000000
#define _ADCFLTR1_AFEN_LENGTH                    0x00000001

#define _ADCFLTR2_FLTRDATA_POSITION              0x00000000
#define _ADCFLTR2_FLTRDATA_MASK                  0x0000FFFF
#define _ADCFLTR2_FLTRDATA_LENGTH                0x00000010

#define _ADCFLTR2_CHNLID_POSITION                0x00000010
#define _ADCFLTR2_CHNLID_MASK                    0x001F0000
#define _ADCFLTR2_CHNLID_LENGTH                  0x00000005

#define _ADCFLTR2_AFRDY_POSITION                 0x00000018
#define _ADCFLTR2_AFRDY_MASK                     0x01000000
#define _ADCFLTR2_AFRDY_LENGTH                   0x00000001

#define _ADCFLTR2_AFGIEN_POSITION                0x00000019
#define _ADCFLTR2_AFGIEN_MASK                    0x02000000
#define _ADCFLTR2_AFGIEN_LENGTH                  0x00000001

#define _ADCFLTR2_OVRSAM_POSITION                0x0000001A
#define _ADCFLTR2_OVRSAM_MASK                    0x1C000000
#define _ADCFLTR2_OVRSAM_LENGTH                  0x00000003

