codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mz0512efk144.h
#define _ODCJ_ODCJ4_POSITION                     0x00000004
#define _ODCJ_ODCJ4_MASK                         0x00000010
#define _ODCJ_ODCJ4_LENGTH                       0x00000001

#define _ODCJ_ODCJ5_POSITION                     0x00000005
#define _ODCJ_ODCJ5_MASK                         0x00000020
#define _ODCJ_ODCJ5_LENGTH                       0x00000001

#define _ODCJ_ODCJ6_POSITION                     0x00000006
#define _ODCJ_ODCJ6_MASK                         0x00000040
#define _ODCJ_ODCJ6_LENGTH                       0x00000001

#define _ODCJ_ODCJ7_POSITION                     0x00000007
#define _ODCJ_ODCJ7_MASK                         0x00000080
#define _ODCJ_ODCJ7_LENGTH                       0x00000001

#define _ODCJ_ODCJ8_POSITION                     0x00000008
#define _ODCJ_ODCJ8_MASK                         0x00000100
#define _ODCJ_ODCJ8_LENGTH                       0x00000001

#define _ODCJ_ODCJ9_POSITION                     0x00000009
#define _ODCJ_ODCJ9_MASK                         0x00000200
#define _ODCJ_ODCJ9_LENGTH                       0x00000001

#define _ODCJ_ODCJ10_POSITION                    0x0000000A
#define _ODCJ_ODCJ10_MASK                        0x00000400
#define _ODCJ_ODCJ10_LENGTH                      0x00000001

#define _ODCJ_ODCJ11_POSITION                    0x0000000B
#define _ODCJ_ODCJ11_MASK                        0x00000800
#define _ODCJ_ODCJ11_LENGTH                      0x00000001

#define _ODCJ_ODCJ12_POSITION                    0x0000000C
#define _ODCJ_ODCJ12_MASK                        0x00001000
#define _ODCJ_ODCJ12_LENGTH                      0x00000001

#define _ODCJ_ODCJ13_POSITION                    0x0000000D
#define _ODCJ_ODCJ13_MASK                        0x00002000
#define _ODCJ_ODCJ13_LENGTH                      0x00000001

#define _ODCJ_ODCJ14_POSITION                    0x0000000E
#define _ODCJ_ODCJ14_MASK                        0x00004000
#define _ODCJ_ODCJ14_LENGTH                      0x00000001

#define _ODCJ_ODCJ15_POSITION                    0x0000000F
#define _ODCJ_ODCJ15_MASK                        0x00008000
#define _ODCJ_ODCJ15_LENGTH                      0x00000001

#define _ODCJ_w_POSITION                         0x00000000
#define _ODCJ_w_MASK                             0xFFFFFFFF
#define _ODCJ_w_LENGTH                           0x00000020

#define _CNPUJ_CNPUJ0_POSITION                   0x00000000
#define _CNPUJ_CNPUJ0_MASK                       0x00000001
#define _CNPUJ_CNPUJ0_LENGTH                     0x00000001

#define _CNPUJ_CNPUJ1_POSITION                   0x00000001
#define _CNPUJ_CNPUJ1_MASK                       0x00000002
#define _CNPUJ_CNPUJ1_LENGTH                     0x00000001

#define _CNPUJ_CNPUJ2_POSITION                   0x00000002
#define _CNPUJ_CNPUJ2_MASK                       0x00000004
#define _CNPUJ_CNPUJ2_LENGTH                     0x00000001

#define _CNPUJ_CNPUJ3_POSITION                   0x00000003
#define _CNPUJ_CNPUJ3_MASK                       0x00000008
#define _CNPUJ_CNPUJ3_LENGTH                     0x00000001

#define _CNPUJ_CNPUJ4_POSITION                   0x00000004
#define _CNPUJ_CNPUJ4_MASK                       0x00000010
#define _CNPUJ_CNPUJ4_LENGTH                     0x00000001

#define _CNPUJ_CNPUJ5_POSITION                   0x00000005
#define _CNPUJ_CNPUJ5_MASK                       0x00000020
#define _CNPUJ_CNPUJ5_LENGTH                     0x00000001

#define _CNPUJ_CNPUJ6_POSITION                   0x00000006
#define _CNPUJ_CNPUJ6_MASK                       0x00000040
#define _CNPUJ_CNPUJ6_LENGTH                     0x00000001

#define _CNPUJ_CNPUJ7_POSITION                   0x00000007
#define _CNPUJ_CNPUJ7_MASK                       0x00000080
#define _CNPUJ_CNPUJ7_LENGTH                     0x00000001

#define _CNPUJ_CNPUJ8_POSITION                   0x00000008
#define _CNPUJ_CNPUJ8_MASK                       0x00000100
#define _CNPUJ_CNPUJ8_LENGTH                     0x00000001

#define _CNPUJ_CNPUJ9_POSITION                   0x00000009
#define _CNPUJ_CNPUJ9_MASK                       0x00000200
#define _CNPUJ_CNPUJ9_LENGTH                     0x00000001

#define _CNPUJ_CNPUJ10_POSITION                  0x0000000A
#define _CNPUJ_CNPUJ10_MASK                      0x00000400
#define _CNPUJ_CNPUJ10_LENGTH                    0x00000001

#define _CNPUJ_CNPUJ11_POSITION                  0x0000000B
#define _CNPUJ_CNPUJ11_MASK                      0x00000800
#define _CNPUJ_CNPUJ11_LENGTH                    0x00000001

#define _CNPUJ_CNPUJ12_POSITION                  0x0000000C
#define _CNPUJ_CNPUJ12_MASK                      0x00001000
#define _CNPUJ_CNPUJ12_LENGTH                    0x00000001

#define _CNPUJ_CNPUJ13_POSITION                  0x0000000D
#define _CNPUJ_CNPUJ13_MASK                      0x00002000
#define _CNPUJ_CNPUJ13_LENGTH                    0x00000001

#define _CNPUJ_CNPUJ14_POSITION                  0x0000000E
#define _CNPUJ_CNPUJ14_MASK                      0x00004000
#define _CNPUJ_CNPUJ14_LENGTH                    0x00000001

#define _CNPUJ_CNPUJ15_POSITION                  0x0000000F
#define _CNPUJ_CNPUJ15_MASK                      0x00008000
#define _CNPUJ_CNPUJ15_LENGTH                    0x00000001

#define _CNPUJ_w_POSITION                        0x00000000
#define _CNPUJ_w_MASK                            0xFFFFFFFF
#define _CNPUJ_w_LENGTH                          0x00000020

#define _CNPDJ_CNPDJ0_POSITION                   0x00000000
#define _CNPDJ_CNPDJ0_MASK                       0x00000001
#define _CNPDJ_CNPDJ0_LENGTH                     0x00000001

#define _CNPDJ_CNPDJ1_POSITION                   0x00000001
#define _CNPDJ_CNPDJ1_MASK                       0x00000002
#define _CNPDJ_CNPDJ1_LENGTH                     0x00000001

#define _CNPDJ_CNPDJ2_POSITION                   0x00000002
#define _CNPDJ_CNPDJ2_MASK                       0x00000004
#define _CNPDJ_CNPDJ2_LENGTH                     0x00000001

#define _CNPDJ_CNPDJ3_POSITION                   0x00000003
#define _CNPDJ_CNPDJ3_MASK                       0x00000008
#define _CNPDJ_CNPDJ3_LENGTH                     0x00000001

#define _CNPDJ_CNPDJ4_POSITION                   0x00000004
#define _CNPDJ_CNPDJ4_MASK                       0x00000010
#define _CNPDJ_CNPDJ4_LENGTH                     0x00000001

